def solution(n, count):
    answer = 0
    MOD = 1000000007
    dp = [[0]*(n+1) for _ in range(n+1)]
    dp[1][1] = 1
    for i in range(2, n+1):
        for j in range(i+1):
            dp[i][j] = (dp[i-1][j-1] + dp[i-1][j] * (i-1) * 2) % MOD
    
    return dp[n][count]
    return answer

'''
dp[i][i] = 1

dp[1][1] = 1

dp[2][1] = dp[1][0] + dp[1][1] x ? = 2
dp[2][2] = dp[1][1] = 1

dp[3][1] = dp[2][0] + dp[2][1] x ?
dp[3][2] = dp[2][1] + dp[2][2] x ?
dp[3][3] = dp[2][2]

dp[2][2] 부터 이전 값을 사용

dp[2][1] 일때
이전 dp[1][1] 값을 사용

2 = 2_2_
3 = 3_2_2_3_, 3_3_2_2_
4 = 4_3_2_2_3_4_
이전 값에 11의 위치만을 추가한다 할 때
dp[i-1][1] x dp[]

2일때 dp[1][1]개의 2자리
3일때 dp[2][1]개의 4자리
4일때 dp[3][1]개의 6자리
(i-1)x2씩 증가

dp[1][1] = 1
dp[2][1] = dp[1][0] + dp[1][1]x (1) x 2

dp[3][1] = dp[2][0] + dp[2][1] x 2 x 2
dp[3][2] = dp[2][1] + dp[2][2] x 2 x 2

[1 0 0]
[2 1 0]
[8 6 1]
'''